zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/pio/same70q21b.h
#define PIN_PE2A_SMC_D10                           _L_(130)     /**< SMC signal: D10 on PE2 mux A*/
#define MUX_PE2A_SMC_D10                           _L_(0)       /**< SMC signal line function value: D10 */
#define PIO_PE2A_SMC_D10                           (_UL_(1) << 2)

#define PIN_PE3A_SMC_D11                           _L_(131)     /**< SMC signal: D11 on PE3 mux A*/
#define MUX_PE3A_SMC_D11                           _L_(0)       /**< SMC signal line function value: D11 */
#define PIO_PE3A_SMC_D11                           (_UL_(1) << 3)

#define PIN_PE4A_SMC_D12                           _L_(132)     /**< SMC signal: D12 on PE4 mux A*/
#define MUX_PE4A_SMC_D12                           _L_(0)       /**< SMC signal line function value: D12 */
#define PIO_PE4A_SMC_D12                           (_UL_(1) << 4)

#define PIN_PE5A_SMC_D13                           _L_(133)     /**< SMC signal: D13 on PE5 mux A*/
#define MUX_PE5A_SMC_D13                           _L_(0)       /**< SMC signal line function value: D13 */
#define PIO_PE5A_SMC_D13                           (_UL_(1) << 5)

#define PIN_PA15A_SMC_D14                          _L_(15)      /**< SMC signal: D14 on PA15 mux A*/
#define MUX_PA15A_SMC_D14                          _L_(0)       /**< SMC signal line function value: D14 */
#define PIO_PA15A_SMC_D14                          (_UL_(1) << 15)

#define PIN_PA16A_SMC_D15                          _L_(16)      /**< SMC signal: D15 on PA16 mux A*/
#define MUX_PA16A_SMC_D15                          _L_(0)       /**< SMC signal line function value: D15 */
#define PIO_PA16A_SMC_D15                          (_UL_(1) << 16)

#define PIN_PC9A_SMC_NANDOE                        _L_(73)      /**< SMC signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_SMC_NANDOE                        _L_(0)       /**< SMC signal line function value: NANDOE */
#define PIO_PC9A_SMC_NANDOE                        (_UL_(1) << 9)

#define PIN_PC10A_SMC_NANDWE                       _L_(74)      /**< SMC signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_SMC_NANDWE                       _L_(0)       /**< SMC signal line function value: NANDWE */
#define PIO_PC10A_SMC_NANDWE                       (_UL_(1) << 10)

#define PIN_PC14A_SMC_NCS0                         _L_(78)      /**< SMC signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_SMC_NCS0                         _L_(0)       /**< SMC signal line function value: NCS0 */
#define PIO_PC14A_SMC_NCS0                         (_UL_(1) << 14)

#define PIN_PC15A_SMC_NCS1                         _L_(79)      /**< SMC signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_SMC_NCS1                         _L_(0)       /**< SMC signal line function value: NCS1 */
#define PIO_PC15A_SMC_NCS1                         (_UL_(1) << 15)

#define PIN_PC15A_SMC_SDCS                         _L_(79)      /**< SMC signal: SDCS on PC15 mux A*/
#define MUX_PC15A_SMC_SDCS                         _L_(0)       /**< SMC signal line function value: SDCS */
#define PIO_PC15A_SMC_SDCS                         (_UL_(1) << 15)

#define PIN_PD18A_SMC_NCS1                         _L_(114)     /**< SMC signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_SMC_NCS1                         _L_(0)       /**< SMC signal line function value: NCS1 */
#define PIO_PD18A_SMC_NCS1                         (_UL_(1) << 18)

#define PIN_PD18A_SMC_SDCS                         _L_(114)     /**< SMC signal: SDCS on PD18 mux A*/
#define MUX_PD18A_SMC_SDCS                         _L_(0)       /**< SMC signal line function value: SDCS */
#define PIO_PD18A_SMC_SDCS                         (_UL_(1) << 18)

#define PIN_PA22C_SMC_NCS2                         _L_(22)      /**< SMC signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_SMC_NCS2                         _L_(2)       /**< SMC signal line function value: NCS2 */
#define PIO_PA22C_SMC_NCS2                         (_UL_(1) << 22)

#define PIN_PC12A_SMC_NCS3                         _L_(76)      /**< SMC signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_SMC_NCS3                         _L_(0)       /**< SMC signal line function value: NCS3 */
#define PIO_PC12A_SMC_NCS3                         (_UL_(1) << 12)

#define PIN_PD19A_SMC_NCS3                         _L_(115)     /**< SMC signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_SMC_NCS3                         _L_(0)       /**< SMC signal line function value: NCS3 */
#define PIO_PD19A_SMC_NCS3                         (_UL_(1) << 19)

#define PIN_PC11A_SMC_NRD                          _L_(75)      /**< SMC signal: NRD on PC11 mux A*/
#define MUX_PC11A_SMC_NRD                          _L_(0)       /**< SMC signal line function value: NRD */
#define PIO_PC11A_SMC_NRD                          (_UL_(1) << 11)

#define PIN_PC13A_SMC_NWAIT                        _L_(77)      /**< SMC signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_SMC_NWAIT                        _L_(0)       /**< SMC signal line function value: NWAIT */
#define PIO_PC13A_SMC_NWAIT                        (_UL_(1) << 13)

#define PIN_PC8A_SMC_NWR0                          _L_(72)      /**< SMC signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_SMC_NWR0                          _L_(0)       /**< SMC signal line function value: NWR0 */
#define PIO_PC8A_SMC_NWR0                          (_UL_(1) << 8)

#define PIN_PC8A_SMC_NWE                           _L_(72)      /**< SMC signal: NWE on PC8 mux A*/
#define MUX_PC8A_SMC_NWE                           _L_(0)       /**< SMC signal line function value: NWE */
#define PIO_PC8A_SMC_NWE                           (_UL_(1) << 8)

#define PIN_PD15C_SMC_NWR1                         _L_(111)     /**< SMC signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_SMC_NWR1                         _L_(2)       /**< SMC signal line function value: NWR1 */
#define PIO_PD15C_SMC_NWR1                         (_UL_(1) << 15)

#define PIN_PD15C_SMC_NBS1                         _L_(111)     /**< SMC signal: NBS1 on PD15 mux C*/
#define MUX_PD15C_SMC_NBS1                         _L_(2)       /**< SMC signal line function value: NBS1 */
#define PIO_PD15C_SMC_NBS1                         (_UL_(1) << 15)

#define PIN_PD16C_SMC_RAS                          _L_(112)     /**< SMC signal: RAS on PD16 mux C*/
#define MUX_PD16C_SMC_RAS                          _L_(2)       /**< SMC signal line function value: RAS */
#define PIO_PD16C_SMC_RAS                          (_UL_(1) << 16)

#define PIN_PC13C_SMC_SDA10                        _L_(77)      /**< SMC signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_SMC_SDA10                        _L_(2)       /**< SMC signal line function value: SDA10 */
#define PIO_PC13C_SMC_SDA10                        (_UL_(1) << 13)

#define PIN_PD13C_SMC_SDA10                        _L_(109)     /**< SMC signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_SMC_SDA10                        _L_(2)       /**< SMC signal line function value: SDA10 */
#define PIO_PD13C_SMC_SDA10                        (_UL_(1) << 13)

#define PIN_PD23C_SMC_SDCK                         _L_(119)     /**< SMC signal: SDCK on PD23 mux C*/
#define MUX_PD23C_SMC_SDCK                         _L_(2)       /**< SMC signal line function value: SDCK */
#define PIO_PD23C_SMC_SDCK                         (_UL_(1) << 23)

#define PIN_PD14C_SMC_SDCKE                        _L_(110)     /**< SMC signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_SMC_SDCKE                        _L_(2)       /**< SMC signal line function value: SDCKE */
#define PIO_PD14C_SMC_SDCKE                        (_UL_(1) << 14)

#define PIN_PD29C_SMC_SDWE                         _L_(125)     /**< SMC signal: SDWE on PD29 mux C*/
#define MUX_PD29C_SMC_SDWE                         _L_(2)       /**< SMC signal line function value: SDWE */
#define PIO_PD29C_SMC_SDWE                         (_UL_(1) << 29)

/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PD20B_SPI0_MISO                        _L_(116)     /**< SPI0 signal: MISO on PD20 mux B*/
#define MUX_PD20B_SPI0_MISO                        _L_(1)       /**< SPI0 signal line function value: MISO */
#define PIO_PD20B_SPI0_MISO                        (_UL_(1) << 20)

#define PIN_PD21B_SPI0_MOSI                        _L_(117)     /**< SPI0 signal: MOSI on PD21 mux B*/
#define MUX_PD21B_SPI0_MOSI                        _L_(1)       /**< SPI0 signal line function value: MOSI */
#define PIO_PD21B_SPI0_MOSI                        (_UL_(1) << 21)

#define PIN_PB2D_SPI0_NPCS0                        _L_(34)      /**< SPI0 signal: NPCS0 on PB2 mux D*/
#define MUX_PB2D_SPI0_NPCS0                        _L_(3)       /**< SPI0 signal line function value: NPCS0 */
#define PIO_PB2D_SPI0_NPCS0                        (_UL_(1) << 2)

#define PIN_PA31A_SPI0_NPCS1                       _L_(31)      /**< SPI0 signal: NPCS1 on PA31 mux A*/
#define MUX_PA31A_SPI0_NPCS1                       _L_(0)       /**< SPI0 signal line function value: NPCS1 */
#define PIO_PA31A_SPI0_NPCS1                       (_UL_(1) << 31)

