zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/pio/same70q21b.h
/* ========== PIO definition for USART2 peripheral ========== */
#define PIN_PD19B_USART2_CTS2                      _L_(115)     /**< USART2 signal: CTS2 on PD19 mux B*/
#define MUX_PD19B_USART2_CTS2                      _L_(1)       /**< USART2 signal line function value: CTS2 */
#define PIO_PD19B_USART2_CTS2                      (_UL_(1) << 19)

#define PIN_PD4D_USART2_DCD2                       _L_(100)     /**< USART2 signal: DCD2 on PD4 mux D*/
#define MUX_PD4D_USART2_DCD2                       _L_(3)       /**< USART2 signal line function value: DCD2 */
#define PIO_PD4D_USART2_DCD2                       (_UL_(1) << 4)

#define PIN_PD6D_USART2_DSR2                       _L_(102)     /**< USART2 signal: DSR2 on PD6 mux D*/
#define MUX_PD6D_USART2_DSR2                       _L_(3)       /**< USART2 signal line function value: DSR2 */
#define PIO_PD6D_USART2_DSR2                       (_UL_(1) << 6)

#define PIN_PD5D_USART2_DTR2                       _L_(101)     /**< USART2 signal: DTR2 on PD5 mux D*/
#define MUX_PD5D_USART2_DTR2                       _L_(3)       /**< USART2 signal line function value: DTR2 */
#define PIO_PD5D_USART2_DTR2                       (_UL_(1) << 5)

#define PIN_PD7D_USART2_RI2                        _L_(103)     /**< USART2 signal: RI2 on PD7 mux D*/
#define MUX_PD7D_USART2_RI2                        _L_(3)       /**< USART2 signal line function value: RI2 */
#define PIO_PD7D_USART2_RI2                        (_UL_(1) << 7)

#define PIN_PD18B_USART2_RTS2                      _L_(114)     /**< USART2 signal: RTS2 on PD18 mux B*/
#define MUX_PD18B_USART2_RTS2                      _L_(1)       /**< USART2 signal line function value: RTS2 */
#define PIO_PD18B_USART2_RTS2                      (_UL_(1) << 18)

#define PIN_PD15B_USART2_RXD2                      _L_(111)     /**< USART2 signal: RXD2 on PD15 mux B*/
#define MUX_PD15B_USART2_RXD2                      _L_(1)       /**< USART2 signal line function value: RXD2 */
#define PIO_PD15B_USART2_RXD2                      (_UL_(1) << 15)

#define PIN_PD17B_USART2_SCK2                      _L_(113)     /**< USART2 signal: SCK2 on PD17 mux B*/
#define MUX_PD17B_USART2_SCK2                      _L_(1)       /**< USART2 signal line function value: SCK2 */
#define PIO_PD17B_USART2_SCK2                      (_UL_(1) << 17)

#define PIN_PD16B_USART2_TXD2                      _L_(112)     /**< USART2 signal: TXD2 on PD16 mux B*/
#define MUX_PD16B_USART2_TXD2                      _L_(1)       /**< USART2 signal line function value: TXD2 */
#define PIO_PD16B_USART2_TXD2                      (_UL_(1) << 16)

/* ========== PIO definition for EBI peripheral ========== */
#define PIN_PC18A_EBI_A0                           _L_(82)      /**< EBI signal: A0 on PC18 mux A*/
#define MUX_PC18A_EBI_A0                           _L_(0)       /**< EBI signal line function value: A0 */
#define PIO_PC18A_EBI_A0                           (_UL_(1) << 18)

#define PIN_PC18A_EBI_NBS0                         _L_(82)      /**< EBI signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_EBI_NBS0                         _L_(0)       /**< EBI signal line function value: NBS0 */
#define PIO_PC18A_EBI_NBS0                         (_UL_(1) << 18)

#define PIN_PC19A_EBI_A1                           _L_(83)      /**< EBI signal: A1 on PC19 mux A*/
#define MUX_PC19A_EBI_A1                           _L_(0)       /**< EBI signal line function value: A1 */
#define PIO_PC19A_EBI_A1                           (_UL_(1) << 19)

#define PIN_PC20A_EBI_A2                           _L_(84)      /**< EBI signal: A2 on PC20 mux A*/
#define MUX_PC20A_EBI_A2                           _L_(0)       /**< EBI signal line function value: A2 */
#define PIO_PC20A_EBI_A2                           (_UL_(1) << 20)

#define PIN_PC21A_EBI_A3                           _L_(85)      /**< EBI signal: A3 on PC21 mux A*/
#define MUX_PC21A_EBI_A3                           _L_(0)       /**< EBI signal line function value: A3 */
#define PIO_PC21A_EBI_A3                           (_UL_(1) << 21)

#define PIN_PC22A_EBI_A4                           _L_(86)      /**< EBI signal: A4 on PC22 mux A*/
#define MUX_PC22A_EBI_A4                           _L_(0)       /**< EBI signal line function value: A4 */
#define PIO_PC22A_EBI_A4                           (_UL_(1) << 22)

#define PIN_PC23A_EBI_A5                           _L_(87)      /**< EBI signal: A5 on PC23 mux A*/
#define MUX_PC23A_EBI_A5                           _L_(0)       /**< EBI signal line function value: A5 */
#define PIO_PC23A_EBI_A5                           (_UL_(1) << 23)

#define PIN_PC24A_EBI_A6                           _L_(88)      /**< EBI signal: A6 on PC24 mux A*/
#define MUX_PC24A_EBI_A6                           _L_(0)       /**< EBI signal line function value: A6 */
#define PIO_PC24A_EBI_A6                           (_UL_(1) << 24)

#define PIN_PC25A_EBI_A7                           _L_(89)      /**< EBI signal: A7 on PC25 mux A*/
#define MUX_PC25A_EBI_A7                           _L_(0)       /**< EBI signal line function value: A7 */
#define PIO_PC25A_EBI_A7                           (_UL_(1) << 25)

#define PIN_PC26A_EBI_A8                           _L_(90)      /**< EBI signal: A8 on PC26 mux A*/
#define MUX_PC26A_EBI_A8                           _L_(0)       /**< EBI signal line function value: A8 */
#define PIO_PC26A_EBI_A8                           (_UL_(1) << 26)

#define PIN_PC27A_EBI_A9                           _L_(91)      /**< EBI signal: A9 on PC27 mux A*/
#define MUX_PC27A_EBI_A9                           _L_(0)       /**< EBI signal line function value: A9 */
#define PIO_PC27A_EBI_A9                           (_UL_(1) << 27)

#define PIN_PC28A_EBI_A10                          _L_(92)      /**< EBI signal: A10 on PC28 mux A*/
#define MUX_PC28A_EBI_A10                          _L_(0)       /**< EBI signal line function value: A10 */
#define PIO_PC28A_EBI_A10                          (_UL_(1) << 28)

#define PIN_PC29A_EBI_A11                          _L_(93)      /**< EBI signal: A11 on PC29 mux A*/
#define MUX_PC29A_EBI_A11                          _L_(0)       /**< EBI signal line function value: A11 */
#define PIO_PC29A_EBI_A11                          (_UL_(1) << 29)

#define PIN_PC30A_EBI_A12                          _L_(94)      /**< EBI signal: A12 on PC30 mux A*/
#define MUX_PC30A_EBI_A12                          _L_(0)       /**< EBI signal line function value: A12 */
#define PIO_PC30A_EBI_A12                          (_UL_(1) << 30)

