zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/pio/same70q21b.h
#define PIN_PE1A_EBI_D9                            _L_(129)     /**< EBI signal: D9 on PE1 mux A*/
#define MUX_PE1A_EBI_D9                            _L_(0)       /**< EBI signal line function value: D9 */
#define PIO_PE1A_EBI_D9                            (_UL_(1) << 1)

#define PIN_PE2A_EBI_D10                           _L_(130)     /**< EBI signal: D10 on PE2 mux A*/
#define MUX_PE2A_EBI_D10                           _L_(0)       /**< EBI signal line function value: D10 */
#define PIO_PE2A_EBI_D10                           (_UL_(1) << 2)

#define PIN_PE3A_EBI_D11                           _L_(131)     /**< EBI signal: D11 on PE3 mux A*/
#define MUX_PE3A_EBI_D11                           _L_(0)       /**< EBI signal line function value: D11 */
#define PIO_PE3A_EBI_D11                           (_UL_(1) << 3)

#define PIN_PE4A_EBI_D12                           _L_(132)     /**< EBI signal: D12 on PE4 mux A*/
#define MUX_PE4A_EBI_D12                           _L_(0)       /**< EBI signal line function value: D12 */
#define PIO_PE4A_EBI_D12                           (_UL_(1) << 4)

#define PIN_PE5A_EBI_D13                           _L_(133)     /**< EBI signal: D13 on PE5 mux A*/
#define MUX_PE5A_EBI_D13                           _L_(0)       /**< EBI signal line function value: D13 */
#define PIO_PE5A_EBI_D13                           (_UL_(1) << 5)

#define PIN_PA15A_EBI_D14                          _L_(15)      /**< EBI signal: D14 on PA15 mux A*/
#define MUX_PA15A_EBI_D14                          _L_(0)       /**< EBI signal line function value: D14 */
#define PIO_PA15A_EBI_D14                          (_UL_(1) << 15)

#define PIN_PA16A_EBI_D15                          _L_(16)      /**< EBI signal: D15 on PA16 mux A*/
#define MUX_PA16A_EBI_D15                          _L_(0)       /**< EBI signal line function value: D15 */
#define PIO_PA16A_EBI_D15                          (_UL_(1) << 16)

#define PIN_PC9A_EBI_NANDOE                        _L_(73)      /**< EBI signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_EBI_NANDOE                        _L_(0)       /**< EBI signal line function value: NANDOE */
#define PIO_PC9A_EBI_NANDOE                        (_UL_(1) << 9)

#define PIN_PC10A_EBI_NANDWE                       _L_(74)      /**< EBI signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_EBI_NANDWE                       _L_(0)       /**< EBI signal line function value: NANDWE */
#define PIO_PC10A_EBI_NANDWE                       (_UL_(1) << 10)

#define PIN_PC14A_EBI_NCS0                         _L_(78)      /**< EBI signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_EBI_NCS0                         _L_(0)       /**< EBI signal line function value: NCS0 */
#define PIO_PC14A_EBI_NCS0                         (_UL_(1) << 14)

#define PIN_PC15A_EBI_NCS1                         _L_(79)      /**< EBI signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_EBI_NCS1                         _L_(0)       /**< EBI signal line function value: NCS1 */
#define PIO_PC15A_EBI_NCS1                         (_UL_(1) << 15)

#define PIN_PC15A_EBI_SDCS                         _L_(79)      /**< EBI signal: SDCS on PC15 mux A*/
#define MUX_PC15A_EBI_SDCS                         _L_(0)       /**< EBI signal line function value: SDCS */
#define PIO_PC15A_EBI_SDCS                         (_UL_(1) << 15)

#define PIN_PD18A_EBI_NCS1                         _L_(114)     /**< EBI signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_EBI_NCS1                         _L_(0)       /**< EBI signal line function value: NCS1 */
#define PIO_PD18A_EBI_NCS1                         (_UL_(1) << 18)

#define PIN_PD18A_EBI_SDCS                         _L_(114)     /**< EBI signal: SDCS on PD18 mux A*/
#define MUX_PD18A_EBI_SDCS                         _L_(0)       /**< EBI signal line function value: SDCS */
#define PIO_PD18A_EBI_SDCS                         (_UL_(1) << 18)

#define PIN_PA22C_EBI_NCS2                         _L_(22)      /**< EBI signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_EBI_NCS2                         _L_(2)       /**< EBI signal line function value: NCS2 */
#define PIO_PA22C_EBI_NCS2                         (_UL_(1) << 22)

#define PIN_PC12A_EBI_NCS3                         _L_(76)      /**< EBI signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_EBI_NCS3                         _L_(0)       /**< EBI signal line function value: NCS3 */
#define PIO_PC12A_EBI_NCS3                         (_UL_(1) << 12)

#define PIN_PD19A_EBI_NCS3                         _L_(115)     /**< EBI signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_EBI_NCS3                         _L_(0)       /**< EBI signal line function value: NCS3 */
#define PIO_PD19A_EBI_NCS3                         (_UL_(1) << 19)

#define PIN_PC11A_EBI_NRD                          _L_(75)      /**< EBI signal: NRD on PC11 mux A*/
#define MUX_PC11A_EBI_NRD                          _L_(0)       /**< EBI signal line function value: NRD */
#define PIO_PC11A_EBI_NRD                          (_UL_(1) << 11)

#define PIN_PC13A_EBI_NWAIT                        _L_(77)      /**< EBI signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_EBI_NWAIT                        _L_(0)       /**< EBI signal line function value: NWAIT */
#define PIO_PC13A_EBI_NWAIT                        (_UL_(1) << 13)

#define PIN_PC8A_EBI_NWR0                          _L_(72)      /**< EBI signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_EBI_NWR0                          _L_(0)       /**< EBI signal line function value: NWR0 */
#define PIO_PC8A_EBI_NWR0                          (_UL_(1) << 8)

#define PIN_PC8A_EBI_NWE                           _L_(72)      /**< EBI signal: NWE on PC8 mux A*/
#define MUX_PC8A_EBI_NWE                           _L_(0)       /**< EBI signal line function value: NWE */
#define PIO_PC8A_EBI_NWE                           (_UL_(1) << 8)

#define PIN_PD15C_EBI_NWR1                         _L_(111)     /**< EBI signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_EBI_NWR1                         _L_(2)       /**< EBI signal line function value: NWR1 */
#define PIO_PD15C_EBI_NWR1                         (_UL_(1) << 15)

